import { Component, OnInit } from '@angular/core';
import { Output,EventEmitter,Input} from '@angular/core';
import * as $ from 'jquery';
@Component({
  selector: 'selectAddress',
  templateUrl:'./selectAddress.html',
  styleUrls: ['./selectAddress.scss']
})
export class selectAddress implements OnInit {
  addressArray:any=[
    ['全局-机器参数',['Code0','0x00120000'],['Code1','0x00120001'],['Code2','0x00120002'],['Code3','0x00120003'],['Code4','0x00120004'],['Code5','0x00120005'],['Code43','0x00120006'],['Code44','0x00120007'],['Code48','0x00120008'],['Code49','0x00120009'],['Code50','0x0012000a'],['Code51','0x0012000b'],['Code52','0x0012000c'],['Code53','0x0012000d'],['Code54','0x0012000e'],['Code8','0x0012000f'],['Code9','0x00120010'],['Code10','0x00120011'],['机器类型','0x00120012'],['备用2','0x00120013'],['备用3','0x00120014'],['备用4','0x00120015'],['备用5','0x00120016'],['备用6','0x00120017'],['Code6','0x00120018'],['Code7','0x00120019'],['Code11','0x0012001a'],['Code12','0x0012001b'],['Code13','0x0012001c'],['Code14','0x0012001d'],['Code15','0x0012001e'],['系统压力上限','0x00120021'],['储料RPM孔数','0x00120023'],['推力座型号','0x00120026'],['开关模压力上限','0x00120027'],['小动作压力上限','0x00120029'],['托模流量上限','0x0012002c'],['保压流量上限','0x0012002d'],['储料背压压力上限','0x0012002e'],['储料压力上限','0x0012002f'],['储料速度上限','0x00120030']],
    ['全局-模具参数',['冷却开模功能','0x00130000'],['压塑功能','0x00130001'],['再循环计时','0x00130002'],['开模连动选择','0x00130003'],['全程计时警报上限','0x00130006'],['连动阀延时关计时','0x00130009']],
    ['马达-机器参数',['电机温度上限','0x04120006']],
    ['温度控制-机器参数',['温度下限警报值','0x05120000'],['温度上限警报值','0x05120001'],['油温下限','0x05120002'],['油温上限','0x05120003'],['电热连续加温检查不使用','0x05120004'],['冷却水温差','0x05120005'],['油温开冷却器','0x05120006'],['油温关冷却器','0x05120007'],['料管冷却开','0x0512000a'],['料管冷却关','0x0512000b'],['温度加温缓冲区1','0x0512000c'],['温度加温缓冲区2','0x0512000d'],['温度加温缓冲区3','0x0512000e'],['温度加温缓冲区4','0x0512000f'],['温度加温缓冲区5','0x05120010'],['温度加温缓冲区6','0x05120011'],['温度加温缓冲区7','0x05120012'],['温度加温缓冲区8','0x05120013'],['温度加温缓冲区9','0x05120014'],['温度加温缓冲区10','0x05120015'],['温度加温缓冲区11','0x05120016'],['温度加温缓冲区12','0x05120017'],['温度加温缓冲区13','0x05120018'],['温度加温缓冲区14','0x05120019'],['温度加温缓冲区15','0x0512001a'],['温度加温缓冲区16','0x0512001b'],['温控1#系数','0x0512001c'],['温控2#系数','0x0512001d'],['温控3#系数','0x0512001e'],['温控4#系数','0x0512001f'],['温控5#系数','0x05120020'],['温控6#系数','0x05120021'],['温控7#系数','0x05120022'],['温控8#系数','0x05120023'],['温控9#系数','0x05120024'],['温控10#系数','0x05120025'],['温控11#系数','0x05120026'],['温控12#系数','0x05120027'],['温控13#系数','0x05120028'],['温控14#系数','0x05120029']],
    ['温度控制-模具参数',['温度设定值1','0x05130000'],['温度设定值2','0x05130001'],['温度设定值3','0x05130002'],['温度设定值4','0x05130003'],['温度设定值5','0x05130004'],['温度设定值6','0x05130005'],['温度设定值7','0x05130006'],['温度设定值8','0x05130007'],['温度设定值9','0x05130008'],['温度设定值10','0x05130009'],['温度设定值11','0x0513000a'],['温度设定值12','0x0513000b'],['温度设定值13','0x0513000c'],['温度设定值14','0x0513000d'],['温度设定值15','0x0513000e'],['温度设定值16','0x0513000f'],['防冷启动计时','0x05130030'],['保温功能选择','0x05130032'],['保温温度','0x05130033'],['手动温控周期','0x05130034'],['手动加热百分比','0x05130035'],['料管冷却器使用','0x05130036']],
    ['射出-机器参数',['射出启动压力斜率','0x1012000f'],['射出启动流量斜率','0x10120010'],['射出转换压力斜率','0x10120011'],['射出转换流量斜率','0x10120012'],['保压启动压力斜率','0x10120013'],['保压启动流量斜率','0x10120014'],['射出关闭压力斜率','0x10120015'],['射出关闭流量斜率','0x10120016'],['射出慢速调试压力','0x10120017'],['射出慢速调试流量','0x10120018'],['储料启动压力斜率','0x10120019'],['储料启动流量斜率','0x1012001a'],['储料关闭压力斜率','0x1012001b'],['储料关闭流量斜率','0x1012001c'],['储料慢速调试压力','0x1012001d'],['储料慢速调试流量','0x1012001e'],['射退启动压力斜率','0x1012001f'],['射退启动流量斜率','0x10120020'],['射退关闭压力斜率','0x10120021'],['射退关闭流量斜率','0x10120022'],['射出阀延迟计时','0x10120023'],['射出完阀延迟切计时','0x10120024'],['储料阀延迟计开时','0x10120025'],['储料完阀延迟切计时','0x10120026'],['射退完阀延迟切计时','0x10120028'],['射出完延迟计时','0x10120029'],['射出监控功能','0x1012002a'],['射出液压延迟','0x1012002b'],['储料液压延迟','0x1012002d'],['射退液压延迟','0x1012002e'],['储料阀开延迟','0x1012002f'],['射退阀开延迟','0x10120030'],['储料结束延迟','0x10120031'],['射退结束延迟','0x10120032'],['射出任务前延时','0x10120033']],
    ['射出-模具参数',['射出增压功能','0x10130000'],['射出监控上限','0x10130003'],['射出监控下限','0x10130004'],['射出时不开中子阀','0x10130007'],['压塑时射出一段计时','0x10130008'],['保压转换选择','0x10130009'],['保压转换压力','0x1013000a'],['保压转换位置','0x1013000b'],['保压转换速度','0x1013000d'],['储料背压选择','0x1013000e'],['储料快速功能','0x1013000f'],['再次储料计时','0x10130011'],['射退模式','0x10130012'],['储料前射退时间','0x10130013'],['自动清料计时','0x10130014'],['自动清料计数','0x10130015'],['座进前射出清料功能','0x10130016'],['射出使用段数','0x10130017'],['储料使用段数','0x10130018'],['保压使用段数','0x10130019'],['射出快速阀','0x1013001a'],['射出旁路阀','0x1013001b'],['储料计时警报上限','0x1013001d'],['射退计时警报上限','0x1013001e'],['储料泄压功能','0x1013001f'],['储料前射退模式','0x10130020'],['储料前射退距离','0x10130021']],
    ['射出-动作参数',['射出1段压力','0x10140000'],['射出2段压力','0x10140001'],['射出3段压力','0x10140002'],['射出4段压力','0x10140003'],['射出5段压力','0x10140004'],['射出6段压力','0x10140005'],['射出7段压力','0x10140006'],['射出8段压力','0x10140007'],['射出9段压力','0x10140008'],['射出10段压力','0x10140009'],['保压1段压力','0x1014000a'],['保压2段压力','0x1014000b'],['保压3段压力','0x1014000c'],['保压4段压力','0x1014000d'],['保压5段压力','0x1014000e'],['保压6段压力','0x1014000f'],['保压7段压力','0x10140010'],['保压8段压力','0x10140011'],['保压9段压力','0x10140012'],['保压10段压力','0x10140013'],['射出1段流量','0x10140014'],['射出2段流量','0x10140015'],['射出3段流量','0x10140016'],['射出4段流量','0x10140017'],['射出5段流量','0x10140018'],['射出6段流量','0x10140019'],['射出7段流量','0x1014001a'],['射出8段流量','0x1014001b'],['射出9段流量','0x1014001c'],['射出10段流量','0x1014001d'],['保压1段流量','0x1014001e'],['保压2段流量','0x1014001f'],['保压3段流量','0x10140020'],['保压4段流量','0x10140021'],['保压5段流量','0x10140022'],['保压6段流量','0x10140023'],['保压7段流量','0x10140024'],['保压8段流量','0x10140025'],['保压9段流量','0x10140026'],['保压10段流量','0x10140027'],['射出1段计时','0x10140028'],['射出2段计时','0x10140029'],['射出3段计时','0x1014002a'],['射出4段计时','0x1014002b'],['射出5段计时','0x1014002c'],['射出6段计时','0x1014002d'],['保压1段计时','0x10140032'],['保压2段计时','0x10140033'],['保压3段计时','0x10140034'],['保压4段计时','0x10140035'],['保压5段计时','0x10140036'],['保压6段计时','0x10140037'],['保压7段计时','0x10140038'],['保压8段计时','0x10140039'],['保压9段计时','0x1014003a'],['保压10段计时','0x1014003b'],['射出1段终止位置','0x1014003c'],['射出2段终止位置','0x1014003d'],['射出3段终止位置','0x1014003e'],['射出4段终止位置','0x1014003f'],['射出5段终止位置','0x10140040'],['射出6段终止位置','0x10140041'],['射出7段终止位置','0x10140042'],['射出8段终止位置','0x10140043'],['射出9段终止位置','0x10140044'],['射出10段终止位置','0x10140045'],['储料1段压力','0x10140046'],['储料2段压力','0x10140047'],['储料3段压力','0x10140048'],['储料4段压力','0x10140049'],['储料5段压力','0x1014004a'],['储料1段背压压力','0x1014004b'],['储料2段背压压力','0x1014004c'],['储料3段背压压力','0x1014004d'],['储料4段背压压力','0x1014004e'],['储料5段背压压力','0x1014004f'],['储料1段流量','0x10140050'],['储料2段流量','0x10140051'],['储料3段流量','0x10140052'],['储料4段流量','0x10140053'],['储料5段流量','0x10140054'],['储料1段终止位置','0x10140055'],['储料2段终止位置','0x10140056'],['储料3段终止位置','0x10140057'],['储料4段终止位置','0x10140058'],['储料5段终止位置','0x10140059'],['射退压力','0x1014005a'],['射退流量','0x1014005b'],['射退终止位置','0x1014005c'],['射退距离','0x1014005d'],['射退计时','0x1014005e']],
    ['射出-液压参数',['射出装模的比例流量限制','0x10150002'],['保压动作的比例流量限制','0x10150007'],['储料动作的比例流量限制','0x1015000c'],['射退动作的比例流量限制','0x10150011']],
    ['座台-机器参数',['座台启动压力斜率','0x11120001'],['座台启动流量斜率','0x11120002'],['座台关闭压力斜率','0x11120003'],['座台关闭流量斜率','0x11120004'],['座台慢速调试压力','0x11120005'],['座台慢速调试流量','0x11120006'],['座进延迟','0x11120007'],['座进完延时','0x11120008'],['延迟座退','0x11120009'],['座退完延时','0x1112000a'],['座台进慢速计时','0x1112000b'],['座退阀延迟切计时','0x1112000c'],['座进液压延迟','0x1112000d'],['座退液压延迟','0x1112000e'],['座进阀开延迟','0x1112000f'],['座进阀关延迟','0x11120010'],['座退阀开延迟','0x11120011']],
    ['座台-模具参数',['储前冷却计时','0x11130000'],['模具冷却时间','0x11130001'],['开模座退','0x11130002']],
    ['座台-动作参数',['座台进压力','0x11140000'],['座台进流量','0x11140001'],['座台进慢速压力','0x11140002'],['座台进慢速流量 ','0x11140003'],['座台退压力','0x11140004'],['座台退流量','0x11140005'],['座台退慢速压力','0x11140006'],['座台退慢速流量','0x11140007'],['座台进慢速终止位置','0x11140008'],['座台退慢速终止位置','0x11140009'],['座台退慢速距离','0x1114000a'],['座台进终止位置','0x1114000b'],['座台退终止位置','0x1114000c'],['座退计时','0x1114000d'],['座进计时','0x1114000e']],
    ['座台-液压参数',['座台动作的PID_KP','0x11150002'],['座台动作的PID_KI','0x11150003'],['座台动作的PID_KD','0x11150004']],
    ['储能部件-模具参数',['射出储能压力上限','0x12130001'],['射出储能压力下限','0x12130002']],
    ['下压缸-动作参数',['下压缸进压力','0x13140000'],['下压缸进流量','0x13140001'],['下压缸退压力','0x13140002'],['下压缸退流量','0x13140003']],
    ['开关模-机器参数',['关模起始压力斜率','0x20120002'],['关模起始流量斜率','0x20120003'],['关模快速压力斜率','0x20120004'],['关模快速流量斜率','0x20120005'],['关模低压压力斜率','0x20120006'],['关模低压流量斜率','0x20120007'],['关模高压压力斜率','0x20120008'],['关模高压流量斜率','0x20120009'],['关模关闭压力斜率','0x2012000a'],['关模关闭流量斜率','0x2012000b'],['关模慢速调试压力','0x2012000c'],['关模慢速调试流量','0x2012000d'],['开模启动压力斜率','0x2012000e'],['开模启动流量斜率','0x2012000f'],['开模快速压力斜率','0x20120010'],['开模快速流量斜率','0x20120011'],['快速2压力斜率','0x20120012'],['快速2流量斜率','0x20120013'],['快速3压力斜率','0x20120014'],['快速3流量斜率','0x20120015'],['开模压力斜率2','0x20120016'],['开模流量斜率2','0x20120017'],['开模关闭压力斜率','0x20120018'],['开模关闭流量斜率','0x20120019'],['开模慢速调试压力','0x2012001a'],['开模慢速调试流量','0x2012001b'],['关模差动阀延迟关计时','0x2012001c'],['关模差动阀延迟开计时','0x2012001d'],['关模低压延迟进计时','0x2012001e'],['关模阀延时关计时','0x20120020'],['开模一慢低压阀延迟关','0x20120021'],['开模一慢低压阀延迟送','0x20120022'],['开模阀延迟切计时','0x20120023'],['关模高压延迟进计时','0x20120024'],['关模结束延迟关计时','0x20120025'],['开模慢速阀动作时间','0x20120026'],['开模完延迟计时','0x20120027'],['开模位置有效区','0x20120028'],['关模动作液压延迟','0x20120029'],['开模动作液压延迟','0x2012002a'],['关模阀开延迟','0x2012002b'],['开模阀开延迟','0x2012002c'],['开模前延时','0x2012002d'],['关模前延时','0x2012002e']],
    ['开关模-模具参数',['关模快速阀1','0x20130000'],['关模高压保持计时','0x20130002'],['关模三段使用','0x20130003'],['开模快速阀','0x20130006'],['开模快速2段','0x20130007'],['连动位置','0x20130008'],['开模四段使用','0x20130009'],['开模停机模式','0x2013000a'],['目标数1','0x2013000b'],['目标数','0x2013000c'],['关模低压计时警报上限','0x2013000e'],['关模高压计时警报上限','0x2013000f'],['关模计时警报上限','0x20130010'],['开模计时警报上限','0x20130011'],['排气前延迟','0x20130012'],['排气计时','0x20130013'],['排气开模计时','0x20130014'],['排气开模距离','0x20130015'],['排气模式','0x20130016'],['前二模不做润滑','0x20130017'],['机械手输出的开模位置设定','0x20130018'],['锁模压力有效区下限','0x20130019'],['锁模压力有效区上限','0x2013001a']],
    ['开关模-动作参数',['压力_关模一段','0x20140000'],['压力_关模二段','0x20140001'],['压力_关模三段','0x20140002'],['压力_低压模保','0x20140003'],['压力_高压模锁','0x20140004'],['速度_关模一段','0x20140005'],['速度_关模二段','0x20140006'],['速度_关模三段','0x20140007'],['速度_低压模保','0x20140008'],['速度_高压模锁','0x20140009'],['终止位置_关模一段','0x2014000a'],['终止位置_关模二段','0x2014000b'],['终止位置_关模三段','0x2014000c'],['终止位置_低压模保','0x2014000d'],['压力_开模一段','0x2014000e'],['压力_开模二段','0x2014000f'],['压力_开模三段','0x20140010'],['压力_开模四段','0x20140011'],['压力_开模终止','0x20140012'],['速度_开模一段','0x20140013'],['速度_开模二段','0x20140014'],['速度_开模三段','0x20140015'],['速度_开模四段','0x20140016'],['速度_开模终止','0x20140017'],['终止位置_开模一段','0x20140018'],['终止位置_开模二段','0x20140019'],['终止位置_开模三段','0x2014001a'],['终止位置_开模四段','0x2014001b'],['终止位置_开模终止','0x2014001c'],['泄压压力','0x2014001d'],['泄压流量','0x2014001e']],
    ['开关模-液压参数',['关模装模的比例流量限制','0x20150001'],['关模慢速的比例流量限制','0x20150002'],['关模快速的比例流量限制','0x20150003'],['关模低压的比例流量限制','0x20150004'],['关模高压的比例流量限制','0x20150005'],['开模装模的比例流量限制','0x20150007'],['开模泄压的比例流量限制','0x20150008'],['开模一慢的比例流量限制','0x20150009'],['开模快速的比例流量限制','0x2015000a'],['开模二慢的比例流量限制','0x2015000b'],['关模PID_KP','0x2015000f'],['关模PID_KI','0x20150010'],['关模PID_KD','0x20150011'],['压模PID_KP','0x20150012'],['压模PID_KI','0x20150013'],['压模PID_KD','0x20150014'],['开模PID_KP','0x20150018'],['开模PID_KI','0x20150019'],['开模PID_KD','0x2015001a']],
    ['脱模1-机器参数',['脱模启动压力斜率','0x21120001'],['脱模启动流量斜率','0x21120002'],['脱模结束压力斜率','0x21120003'],['脱模结束流量斜率','0x21120004'],['脱模慢速调试压力','0x21120005'],['脱模慢速调试流量','0x21120006'],['托模退位置有效区','0x21120007'],['托模退位置最大值','0x21120008'],['托模终检测时间','0x21120009'],['托进液压延迟','0x2112000a'],['托退液压延迟','0x2112000b'],['托模进阀开延迟','0x2112000c'],['托模进阀关延迟','0x2112000d'],['托模退阀开延迟','0x2112000e'],['托模退阀关延迟','0x2112000f'],['托模进结束延迟','0x21120010'],['托模退结束延迟','0x21120011']],
    ['脱模1-模具参数',['脱模进延迟计时','0x21130000'],['脱模退延迟计时','0x21130001'],['托模功能选择','0x21130002'],['托模次数','0x21130003'],['震动托模方式','0x21130004'],['震动托模计时','0x21130005'],['震动托模距离','0x21130006'],['震动托模压力','0x21130007'],['半脱时不切脱进阀选择','0x21130008']],
    ['脱模1-动作参数',['托进1段压力','0x21140000'],['脱模进压力','0x21140001'],['托退1段压力','0x21140002'],['托退2段压力','0x21140003'],['托进1段流量','0x21140004'],['托进2段流量','0x21140005'],['托退1段流量','0x21140006'],['托退2段流量','0x21140007'],['托进1段终止位置','0x21140008'],['托进2段终止位置','0x21140009'],['托退1段终止位置','0x2114000a'],['托退2段终止位置','0x2114000b'],['托模进一段首次终止位置','0x2114000e'],['托模进二段首次终止位置  ','0x2114000f'],['托模退一段首次终止位置 ','0x21140010'],['托模退二段首次终止位置','0x21140011']],
    ['脱模1-液压参数',['脱模动作的比例流量限制','0x21150002'],['脱模动作的PID_KP','0x21150003'],['脱模动作的PID_KI','0x21150004']],
    ['中子A-机器参数',['中子A启动压力斜率','0x22120000'],['中子A启动流量斜率','0x22120001'],['中子A关闭压力斜率','0x22120002'],['中子A关闭流量斜率','0x22120003'],['中子A慢速调试压力','0x22120004'],['中子A慢速调试流量','0x22120005'],['中子A进延迟开','0x22120006'],['中子A退延迟开','0x22120007'],['中子A动作完延时计时','0x22120008'],['途中中子A位置有效区','0x22120009'],['中途中子A动作延迟','0x2212000a'],['中子A进阀开延迟','0x2212000e'],['中子A进阀关延迟','0x2212000f'],['中子A退阀开延迟','0x22120010'],['中子A退阀关延迟','0x22120011']],
    ['中子A-模具参数',['中子A保护功能','0x22130000'],['中子A功能选择','0x22130001'],['中子A控制方式','0x22130002'],['中子A退控制方式','0x22130003'],['特殊中子A功能','0x22130004'],['射出时不开中子阀A','0x22130005']],
    ['中子A-动作参数',['中子A进压力','0x22140000'],['中子A退压力','0x22140001'],['中子A进流量','0x22140002'],['中子A退流量','0x22140003'],['中子A进计时','0x22140004'],['中子A退计时','0x22140005'],['绞牙A进计数','0x22140006'],['绞牙A退计数','0x22140007'],['中子A进动作位置','0x22140008'],['中子A退动作位置','0x22140009'],['中子A慢速压力','0x2214000a'],['中子A退慢速流量','0x2214000b']],
    ['中子A-液压参数',['中子A动作的比例流量限制','0x22150001'],['中子A动作的PID_KP','0x22150002'],['中子A动作的PID_KI','0x22150003']],
    ['中子B-机器参数',['中子B启动压力斜率','0x22220000'],['中子B启动流量斜率','0x22220001'],['中子B关闭压力斜率','0x22220002'],['中子B关闭流量斜率','0x22220003'],['中子B慢速调试压力','0x22220004'],['中子B慢速调试流量','0x22220005'],['中子B进延迟开','0x22220006'],['中子B退延迟开','0x22220007'],['中子B动作完延时计时','0x22220008'],['途中中子B位置有效区','0x22220009'],['中途中子B动作延迟','0x2222000a'],['中子B进阀开延迟','0x2222000e'],['中子B进阀关延迟','0x2222000f'],['中子B退阀开延迟','0x22220010'],['中子B退阀关延迟','0x22220011']],
    ['中子B-模具参数',['中子B保护功能','0x22230000'],['中子B功能选择','0x22230001'],['中子B控制方式','0x22230002'],['中子B退控制方式','0x22230003'],['特殊中子B功能','0x22230004'],['射出时不开中子阀B','0x22230005']],
    ['中子B-动作参数',['中子B进压力','0x22240000'],['中子B退压力','0x22240001'],['中子B进流量','0x22240002'],['中子B退流量','0x22240003'],['中子B进计时','0x22240004'],['中子B退计时','0x22240005'],['绞牙B进计数','0x22240006'],['绞牙B退计数','0x22240007'],['中子B进动作位置','0x22240008'],['中子B退动作位置','0x22240009'],['中子B慢速压力','0x2224000a'],['中子B退慢速流量','0x2224000b']],
    ['中子B-液压参数',['中子B动作的比例流量限制','0x22250001'],['中子B动作的PID_KP','0x22250002'],['中子B动作的PID_KI','0x22250003']],
    ['中子C-机器参数',['中子C启动压力斜率','0x22320000'],['中子C启动流量斜率','0x22320001'],['中子C关闭压力斜率','0x22320002'],['中子C关闭流量斜率','0x22320003'],['中子C慢速调试压力','0x22320004'],['中子C慢速调试流量','0x22320005'],['中子C进延迟开','0x22320006'],['中子C退延迟开','0x22320007'],['中子C动作完延时计时','0x22320008'],['途中中子C位置有效区','0x22320009'],['中途中子C动作延迟','0x2232000a'],['中子C进阀开延迟','0x2232000e'],['中子C进阀关延迟','0x2232000f'],['中子C退阀开延迟','0x22320010'],['中子C退阀关延迟','0x22320011']],
    ['中子C-模具参数',['中子C保护功能','0x22330000'],['中子C功能选择','0x22330001'],['中子C控制方式','0x22330002'],['中子C退控制方式','0x22330003'],['特殊中子C功能','0x22330004'],['射出时不开中子阀C','0x22330005']],
    ['中子C-动作参数',['中子C进压力','0x22340000'],['中子C退压力','0x22340001'],['中子C进流量','0x22340002'],['中子C退流量','0x22340003'],['中子C进计时','0x22340004'],['中子C退计时','0x22340005'],['绞牙C进计数','0x22340006'],['绞牙C退计数','0x22340007'],['中子C进动作位置','0x22340008'],['中子C退动作位置','0x22340009'],['中子C慢速压力','0x2234000a'],['中子C退慢速流量','0x2234000b']],
    ['中子C-液压参数',['中子C动作的比例流量限制','0x22350001'],['中子C动作的PID_KP','0x22350002'],['中子C动作的PID_KI','0x22350003']],
    ['中子D-机器参数',['中子D启动压力斜率','0x22420000'],['中子D启动流量斜率','0x22420001'],['中子D关闭压力斜率','0x22420002'],['中子D关闭流量斜率','0x22420003'],['中子D慢速调试压力','0x22420004'],['中子D慢速调试流量','0x22420005'],['中子D进延迟开','0x22420006'],['中子D退延迟开','0x22420007'],['中子D动作完延时计时','0x22420008'],['途中中子D位置有效区','0x22420009'],['中途中子D动作延迟','0x2242000a'],['中子D进阀开延迟','0x2242000e'],['中子D进阀关延迟','0x2242000f'],['中子D退阀开延迟','0x22420010'],['中子D退阀关延迟','0x22420011']],
    ['中子D-模具参数',['中子D保护功能','0x22430000'],['中子D功能选择','0x22430001'],['中子D控制方式','0x22430002'],['中子D退控制方式','0x22430003'],['特殊中子D功能','0x22430004'],['射出时不开中子阀D','0x22430005']],
    ['中子D-动作参数',['中子D进压力','0x22440000'],['中子D退压力','0x22440001'],['中子D进流量','0x22440002'],['中子D退流量','0x22440003'],['中子D进计时','0x22440004'],['中子D退计时','0x22440005'],['绞牙D进计数','0x22440006'],['绞牙D退计数','0x22440007'],['中子D进动作位置','0x22440008'],['中子D退动作位置','0x22440009'],['中子D慢速压力','0x2244000a'],['中子D退慢速流量','0x2244000b']],
    ['中子D-液压参数',['中子D动作的比例流量限制','0x22450001'],['中子D动作的PID_KP','0x22450002'],['中子D动作的PID_KI','0x22450003']],
    ['中子E-机器参数',['中子E启动压力斜率','0x22520000'],['中子E启动流量斜率','0x22520001'],['中子E关闭压力斜率','0x22520002'],['中子E关闭流量斜率','0x22520003'],['中子E慢速调试压力','0x22520004'],['中子E慢速调试流量','0x22520005'],['中子E进延迟开','0x22520006'],['中子E退延迟开','0x22520007'],['中子E动作完延时计时','0x22520008'],['途中中子E位置有效区','0x22520009'],['中途中子E动作延迟','0x2252000a'],['中子E进阀开延迟','0x2252000e'],['中子E进阀关延迟','0x2252000f'],['中子E退阀开延迟','0x22520010'],['中子E退阀关延迟','0x22520011']],
    ['中子E-模具参数',['中子E保护功能','0x22530000'],['中子E功能选择','0x22530001'],['中子E控制方式','0x22530002'],['中子E退控制方式','0x22530003'],['特殊中子E功能','0x22530004'],['射出时不开中子阀E','0x22530005']],
    ['中子E-动作参数',['中子E进压力','0x22540000'],['中子E退压力','0x22540001'],['中子E进流量','0x22540002'],['中子E退流量','0x22540003'],['中子E进计时','0x22540004'],['中子E退计时','0x22540005'],['绞牙E进计数','0x22540006'],['绞牙E退计数','0x22540007'],['中子E进动作位置','0x22540008'],['中子E退动作位置','0x22540009'],['中子E慢速压力','0x2254000a'],['中子E退慢速流量','0x2254000b']],
    ['中子E-液压参数',['中子E动作的比例流量限制','0x22550001'],['中子E动作的PID_KP','0x22550002'],['中子E动作的PID_KI','0x22550003']],
    ['中子F-机器参数',['中子F启动压力斜率','0x22620000'],['中子F启动流量斜率','0x22620001'],['中子F关闭压力斜率','0x22620002'],['中子F关闭流量斜率','0x22620003'],['中子F慢速调试压力','0x22620004'],['中子F慢速调试流量','0x22620005'],['中子F进延迟开','0x22620006'],['中子F退延迟开','0x22620007'],['中子F动作完延时计时','0x22620008'],['途中中子F位置有效区','0x22620009'],['中子F进阀开延迟','0x2262000e'],['中子F进阀关延迟','0x2262000f'],['中子F退阀开延迟','0x22620010'],['中子F退阀关延迟','0x22620011']],
    ['中子F-模具参数',['中子F保护功能','0x22630000'],['中子F功能选择','0x22630001'],['中子F控制方式','0x22630002'],['中子F退控制方式','0x22630003'],['特殊中子F功能','0x22630004'],['射出时不开中子阀F','0x22630005']],
    ['中子F-动作参数',['中子F进压力','0x22640000'],['中子F退压力','0x22640001'],['中子F进流量','0x22640002'],['中子F退流量','0x22640003'],['中子F进计时','0x22640004'],['中子F退计时','0x22640005'],['绞牙F进计数','0x22640006'],['绞牙F退计数','0x22640007'],['中子F进动作位置','0x22640008'],['中子F退动作位置','0x22640009'],['中子F慢速压力','0x2264000a'],['中子F退慢速流量','0x2264000b']],
    ['中子F-液压参数',['中子F动作的比例流量限制','0x22650001'],['中子F动作的PID_KP','0x22650002'],['中子F动作的PID_KI','0x22650003']],
    ['吹气1-模具参数',['动模吹气1方式','0x23130000'],['动模吹气1位置','0x23130001'],['动模吹气1延迟','0x23130002'],['动模吹气1时间','0x23130003']],
    ['吹气2-模具参数',['静模吹气1方式','0x23230000'],['静模吹气1位置','0x23230001'],['静模吹气1延迟','0x23230002'],['静模吹气1时间','0x23230003']],
    ['吹气3-模具参数',['动模吹气2方式','0x23330000'],['动模吹气2位置','0x23330001'],['动模吹气2延迟','0x23330002'],['动模吹气2时间','0x23330003']],
    ['吹气4-模具参数',['静模吹气2方式','0x23430000'],['静模吹气2位置','0x23430001'],['静模吹气2延迟','0x23430002'],['静模吹气2时间','0x23430003']],
    ['吹气5-模具参数',['动模吹气3方式','0x23530000'],['动模吹气3位置','0x23530001'],['动模吹气3延迟','0x23530002'],['动模吹气3时间','0x23530003']],
    ['吹气6-模具参数',['静模吹气3方式','0x23630000'],['静模吹气3位置','0x23630001'],['静模吹气3延迟','0x23630002'],['静模吹气3时间','0x23630003']],
    ['调模-机器参数',['调模启动流量斜率','0x24120000'],['调模启动压力斜率','0x24120001'],['调模结束流量斜率','0x24120002'],['调模结束压力斜率','0x24120003'],['自动调模关模低压计时','0x24120004']],
    ['调模-动作参数',['调模快速压力','0x24140000'],['调模快速流量','0x24140001'],['调模慢速压力','0x24140002'],['调模慢速流量','0x24140003'],['调模退压力','0x24140004'],['调模退流量','0x24140005'],['调模慢速时间','0x24140006']],
    ['安全门-机器参数',['安全门启动压力斜率','0x29120002'],['安全门启动流量斜率','0x29120003'],['安全门关闭压力斜率','0x29120004'],['安全门关闭流量斜率','0x29120005'],['安全门慢速调试压力','0x29120006'],['安全门慢速调试流量','0x29120007']],
    ['润滑1-机器参数',['润滑模式','0x30120000']],
    ['润滑2-机器参数',['润滑模式2','0x30220000']],
    ['润滑3-机器参数',['润滑模式3','0x30320000']],
    ['机械手-模具参数',['模具机械手','0x31130000']],
    ['状态-状态',['DA_压力1','0x33700009'],['DA_流量1','0x3370000a'],['ST_设定时间','0x3370000b'],['ST_设定时间1','0x3370000c'],['ST_设定时间2','0x3370000d'],['ST_本包良品模数','0x20160004'],['ST_良品总模数','0x20160005'],['开模总数','0x33160013'],['ST_电热','0x0516002b'],['ST_操作时间','0x33700003']],
  ];
  secondList:any=[];//第二列
  indexList:any=[];//存索引
  @Input() isSelect:boolean;
  @Output() addressEvent=new EventEmitter();
  constructor() { }

  ngOnInit() {

  }

  addressSelect(inx){
    this.secondList=[].concat();
    $('.select_body').animate({scrollTop:'0px'},300);//点击后滚动置顶
    this.indexList[0]=inx;
    this.indexList[1]=null;
    $('.first>li:eq('+inx+')').addClass('select').siblings().removeClass('select');
    var text=$('.first>li.select').text();
    for(var i=0;i<this.addressArray.length;i++)
    {
      if(this.addressArray[i][0]==text)
      {
        for(var j=1;j<this.addressArray[i].length;j++)
        {
          this.secondList.push(this.addressArray[i][j]);
        }
      }
    }
  }
  selectCode(inx){
    this.indexList[1]=inx;
    $('.second>li:eq('+inx+')').addClass('select').siblings().removeClass('select');
  }
  output(){
    if(this.indexList[1]==null||this.indexList.length==0)
    {
      alert("请选择参数！");
    }else{
      var one=this.indexList[0];
      var two=this.indexList[1];
      this.addressEvent.emit(this.addressArray[one][two][1]);
      this.isSelect=false;
    }
  }
  close(){
    this.isSelect=false;
    this.addressEvent.emit(null);
  }
}